ProgessBase/Catalogs/ТипыЦенНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ТипыЦенНоменклатуры</Name>
			<Comment>(Упр)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВалютаЦены</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазовыйТипЦен</Name>
					<Comment>(Общ) Тип цен, от которого рассчитываются цены данного типа, если не выбран, то цены задаются вручную</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рассчитывается</Name>
					<Comment>(Общ) Истина - цены автоматически рассчитываются (не хранятся) на основании цен базового типа</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентСкидкиНаценки</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаВключаетНДС</Name>
					<Comment>(Общ) Истина - цена включает НДС, ложь - не включает</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокОкругления</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядкиОкругления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкруглятьВБольшуюСторону</Name>
					<Comment>(Общ) Истина, то при порядке округления "5" 0.01 будет округлена до 5, ложь - округление по арифметическим правилам</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРасчетаЦены</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРасчетаЦены</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПЦ_Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПЦ_КатегорииТиповЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПЦ_Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПРГ_ПроектыГП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПЦ_НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ProgessBase/InformationRegisters/УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре</Name>
			<Comment>(Упр)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютаЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПЦ_ТипЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПЦ_Контрагент</Name>
					<Comment>Добавлен для индивидуальных цен</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПЦ_Регион</Name>
					<Comment>Добавлен для индивидуальных цен</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Регионы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПЦ_КаналПродаж</Name>
					<Comment>Добавлен для индивидуальных цен</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.НСИ_КаналыПродаж</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПЦ_Брендообъем</Name>
					<Comment>Добавлено для ограничения поставки</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.НСИ_Брендообъемы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ProgessBase/Catalogs/ТипыЦенНоменклатуры/Ext/ObjectModule.bsl
//m.ionov@a-prof.ru 04.09.2014
//Сделали иерархическим справочник
//----m.ionov@a-prof.ru---

// Обработчик события ПередЗаписью объекта.
//
Процедура ПередЗаписью(Отказ)

	//m.ionov@a-prof.ru 14.10.2014
	//Если НЕ ОбменДанными.Загрузка И ЗначениеЗаполнено(БазовыйТипЦен) Тогда
	//	// Если цена расчетная и введена на основании расчетной- это неправильно - записывать нельзя
	//	Если БазовыйТипЦен.Рассчитывается Тогда
	//		ОбщегоНазначения.СообщитьОбОшибке("Базовый тип цен не может быть динамическим!", Отказ);
	//		Возврат;
	//	КонецЕсли;
	//КонецЕсли;

	//Если НЕ ОбменДанными.Загрузка И Не ЭтоГруппа Тогда
	//	Если Рассчитывается Тогда
	//		// Если цена расчетная и на основании её введена уже расчетная - это неправильно - записывать нельзя
	//		Запрос = Новый Запрос;
	//		Запрос.УстановитьПараметр("ТекущийТипЦен", ЭтотОбъект.Ссылка);

	//		Запрос.Текст =
	//		"ВЫБРАТЬ
	//		|	ТипЦен.Рассчитывается КАК Рассчитывается,
	//		|	ТипЦен.БазовыйТипЦен КАК БазовыйТипЦен
	//		|ИЗ
	//		|	Справочник.ТипыЦенНоменклатуры КАК ТипЦен
	//		|
	//		|ГДЕ
	//		|	ТипЦен.БазовыйТипЦен = &ТекущийТипЦен
	//		| И ТипЦен.Рассчитывается = Истина";

	//		ВыборкаЦен = Запрос.Выполнить().Выбрать();
	//		Если ВыборкаЦен.Следующий() Тогда
	//			ОбщегоНазначения.СообщитьОбОшибке("Этот тип цен уже используется как базовый, он уже не может быть динамическим!", Отказ);
	//			Возврат;
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЕсли;
	
	Если ОбменДанными.Загрузка ИЛИ ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Если Рассчитывается Тогда
		ТестБазовойЦены = ПЦ_Ценообразование.ВернутьБазовыйТипЦенКлиент(ЭтотОбъект);
		Если Не ЗначениеЗаполнено(ТестБазовойЦены) Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Не верно указан базовый тип цен", отказ);
		КонецЕсли;
	КонецЕсли;
	
	Если ЕстьСсылкиНаТипЦен() Тогда
		Если Ссылка.ПЦ_Категория <> ПЦ_Категория Тогда
			
			ТекстСообщения = НСтр("ru = 'Тип цен уже участвует в ценообразовании. 
                             |Изменить категорию тип цен уже нельзя!'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "ПЦ_Категория",, Отказ);
		КонецЕсли; 
		
		Если Ссылка.ПЦ_Проект <> ПЦ_Проект Тогда
			
			ТекстСообщения = НСтр("ru = 'Тип цен уже участвует в ценообразовании. 
                             |Изменить проект ГП уже нельзя!'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "ПЦ_Проект",, Отказ);
		КонецЕсли;
		
		Если Ссылка.СпособРасчетаЦены <> СпособРасчетаЦены Тогда
			
			ТекстСообщения = НСтр("ru = 'Тип цен уже участвует в ценообразовании. 
                             |Изменить способ расчета цены уже нельзя!'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "СпособРасчетаЦены",, Отказ);
		КонецЕсли;
		
		Если Ссылка.ЦенаВключаетНДС <> ЦенаВключаетНДС Тогда
			
			ТекстСообщения = НСтр("ru = 'Тип цен уже участвует в ценообразовании. 
                             |Изменить цены включают НДС уже нельзя!'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "ЦенаВключаетНДС",, Отказ);
		КонецЕсли;
		
		Если Ссылка.ВалютаЦены <> ВалютаЦены Тогда
			
			ТекстСообщения = НСтр("ru = 'Тип цен уже участвует в ценообразовании. 
                             |Изменить валюту цены уже нельзя!'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "ВалютаЦены",, Отказ);
		КонецЕсли;

	КонецЕсли;
	//----m.ionov@a-prof.ru---

	Если НЕ ОбменДанными.Загрузка Тогда
		НастройкаПравДоступа.ПередЗаписьюНовогоОбъектаСПравамиДоступаПользователей(ЭтотОбъект, Отказ, Родитель);
	КонецЕсли;
	
КонецПроцедуры

//m.ionov@a-prof.ru 14.10.2014
Функция ЕстьСсылкиНаТипЦен() Экспорт
	
	ЕстьСсылки = Ложь;
	
	Если Не ЭтоНовый() и Не ЭтоГруппа Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЦеныНоменклатурыСрезПоследних.ТипЦен
		               |ИЗ
		               |	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, ТипЦен = &ТипЦен) КАК ЦеныНоменклатурыСрезПоследних
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреСрезПоследних.ПЦ_ТипЦен
		               |ИЗ
		               |	РегистрСведений.УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.СрезПоследних(, ПЦ_ТипЦен = &ТипЦен) КАК УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреСрезПоследних";
					   
		Запрос.УстановитьПараметр("ТипЦен", Ссылка);
		
		ЕстьСсылки = Не Запрос.Выполнить().Пустой();
	КонецЕсли;
	
	Возврат ЕстьСсылки;
					   
КонецФункции
//----m.ionov@a-prof.ru---
